import React from 'react'
import s from './Home.module.css'

export const Home = () => {
	return (
		<div className={s.container}>
			<img src='./react.svg' alt='icon' width={160} />
			<div>
				<p>
					QR-коди набули популярності за останні кілька років, особливо серед
					маркетологів, які використовують їх у ряді матеріалів. Багато компаній
					включають QR-коди у свої маркетингові матеріали. Наприклад, ви можете
					побачити їх на плакатах, візитках та листівках. Вони є потужними
					інструментами, якщо їх використовувати правильно.
				</p>
			</div>
			<div>
				<h3>Що таке QR-код?</h3>
			</div>
			<div>
				<p>
					Ваша візитна картка має дивну графіку, що складається з крапок і
					чорних квадратів? Це QR-код. Ідея створення цього коду полягала в
					тому, щоб придумати щось, що смартфон може сканувати. Смартфон містить
					сканер. Просто відчинено Сканер QR-коду у вашому смартфоні і
					перетворює це на щось значуще. У кодах є посилання на веб-адреси та
					інша інформація. Користувачі можуть пов’язати цю інформацію зі
					смартфоном або безліччю інших носіїв інформації. Механізм роботи
					QR-коду - це процес пошуку веб-сайту. <h3>Як це працює?</h3> QR-код
					працює так само, як штрих-код у супермаркеті.{' '}
					<strong>Сканер QR-коду pro це програма</strong>, яка може сканувати
					зображення за допомогою камери смартфона. Кожен QR-код має крапку та
					чорні квадрати і представляє деяку інформацію. Під час сканування
					цього коду ваш смартфон перетворює його на те, що ви можете прочитати.
					Перекладені дані можуть бути числовими, буквено-цифровими або
					двійковими.<br></br> Як і сканер штрих-коду, найкращий сканер QR-коду
					складається з освітлювача, декодера та датчика / перетворювача. Сканер
					штрих-коду висвітлює штрих-код червоним світлом, яке декодер потім
					надсилає на комп'ютер, приєднаний до сканера. У випадку з Додаток
					сканера QR-коду, декодер надсилає інформацію на ваш мобільний телефон,
					а не на комп’ютер. Потім датчик / перетворювач переводить інформацію,
					щоб ви могли її прочитати. Також важливо відзначити, що за допомогою
					смартфона ви можете сканувати QR-код натисканням кнопки. Саме ця
					здатність робить його ідеальним для маркетологів. Якщо ви коли-небудь
					пробували це на своєму телефоні, ви розумієте, наскільки це просто і
					швидко. Це робить QR-код простим для доступу до збереженої інформації.
				</p>
			</div>
			<div>
				<h3>Як створити QR-код</h3>
			</div>
			<div>
				<p>
					Якщо хочеш створити QR-код, то це зовсім не складно. Безліч
					онлайн-генераторів QR-кодів роблять весь процес простим. QR-генератор
					Pageloot - один із найкращих безкоштовних. Він функціональний і
					простий у використанні. При використанні Генератор QR-коду, вам слід
					ввести текст, номер телефону, vCard або SMS для сканування. Веб-сайт
					виконує решту сканування, і це займає лише кілька секунд. Веб-сайт
					працює, і QR-генератор надає вам можливість вбудувати або завантажити
					QR-код.
				</p>
			</div>
		</div>
	)
}
